TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/driverlib/dl_gsc.h
/**
 * @brief Disable HDP access to NONMAIN region in Bank 1
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableNONMAINBank1HDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_NONMAIN1_HDPPROT_CONTROL |=
        GSC_FPC_NONMAIN1_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Enable HDP access to TRIM region in Bank 0
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableTRIMBank0HDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_TRIM0_HDPPROT_CONTROL &=
        ~GSC_FPC_TRIM0_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to TRIM region in Bank 0
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableTRIMBank0HDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_TRIM0_HDPPROT_CONTROL |=
        GSC_FPC_TRIM0_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Enable HDP access to TRIM region in Bank 1
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableTRIMBank1HDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_TRIM1_HDPPROT_CONTROL &=
        ~GSC_FPC_TRIM1_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to TRIM region in Bank 1
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableTRIMBank1HDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_TRIM1_HDPPROT_CONTROL |=
        GSC_FPC_TRIM1_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Enable HDP access to ENGR region in Bank 0
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableENGRBank0HDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_ENGR0_HDPPROT_CONTROL &=
        ~GSC_FPC_ENGR0_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to ENGR region in Bank 0
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableENGRBank0HDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_ENGR0_HDPPROT_CONTROL |=
        GSC_FPC_ENGR0_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Enable HDP access to ENGR region in Bank 1
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableENGRBank1HDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_ENGR1_HDPPROT_CONTROL &=
        ~GSC_FPC_ENGR1_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to ENGR region in Bank 1
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableENGRBank1HDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_ENGR1_HDPPROT_CONTROL |=
        GSC_FPC_ENGR1_HDPPROT_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Configure hide protection region for data flash
 *
 * Configures hide protection for a region of data flash sectors.
 * Each sector is 2KB. Hide protection can be set at sector level but must be
 * managed carefully when overlapping with other protection mechanisms that
 * operate at 8KB (4-sector) page boundaries.
 *
 * @param[in] gsc       Pointer to the GSC peripheral
 * @param[in] startSec  Starting sector number for hide protection
 * @param[in] endSec    Ending sector number for hide protection
 *
 * @note It is the application's responsibility to ensure hide protection regions
 *       are properly aligned when overlapping with other protection mechanisms
 *       that operate at 8KB page boundaries.
 *
 * @return bool Returns true if configuration is valid, false otherwise
 */
bool DL_GSC_configureDataBankHDPRegion(
    GSC_Regs* gsc, uint8_t startSec, uint8_t endSec);

// Data Bank HDP Control
/**
 * @brief Enable HDP access to Data Bank region
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableDataBankHDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_HDPPROT_DBANK_CONTROL &=
        ~GSC_FPC_HDPPROT_DBANK_CONTROL_HDPPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to Data Bank region
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableDataBankHDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_HDPPROT_DBANK_CONTROL |=
        GSC_FPC_HDPPROT_DBANK_CONTROL_HDPPROTACCDIS_MASK;
}

// Data Bank HDP Enable Control
/**
 * @brief Enable HDP mode for Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableDataBankHDPMode(GSC_Regs* gsc)
{
    gsc->FPC_HDPEN_DBANK_CONTROL |= GSC_FPC_HDPEN_DBANK_CONTROL_HDPEN_MASK;
}

/**
 * @brief Disable HDP mode for Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableDataBankHDPMode(GSC_Regs* gsc)
{
    gsc->FPC_HDPEN_DBANK_CONTROL &= ~GSC_FPC_HDPEN_DBANK_CONTROL_HDPEN_MASK;
}

// Data Bank NONMAIN HDP Control
/**
 * @brief Enable HDP access to NONMAIN region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableDataBankNONMAINHDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_NONMAIN_HDPPROT_DBANK_CONTROL &=
        ~GSC_FPC_NONMAIN_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to NONMAIN region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableDataBankNONMAINHDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_NONMAIN_HDPPROT_DBANK_CONTROL |=
        GSC_FPC_NONMAIN_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

// Data Bank TRIM HDP Control
/**
 * @brief Enable HDP access to TRIM region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableDataBankTRIMHDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_TRIM_HDPPROT_DBANK_CONTROL &=
        ~GSC_FPC_TRIM_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to TRIM region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableDataBankTRIMHDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_TRIM_HDPPROT_DBANK_CONTROL |=
        GSC_FPC_TRIM_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

// Data Bank ENGR HDP Control
/**
 * @brief Enable HDP access to ENGR region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enableDataBankENGRHDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_ENGR_HDPPROT_DBANK_CONTROL &=
        ~GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

/**
 * @brief Disable HDP access to ENGR region in Data Bank
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disableDataBankENGRHDPAccess(GSC_Regs* gsc)
{
    gsc->FPC_ENGR_HDPPROT_DBANK_CONTROL |=
        GSC_FPC_ENGR_HDPPROT_DBANK_CONTROL_HDPROTACCDIS_MASK;
}

/**
 *  @brief set VTOR for NS Application Image
 *
 *
 *  @param[in] gsc      Pointer to the register overlay for the peripheral
 *  @param[in] addr_ns  NS addr where NS applications Vector Table resides
 *
 *  @return    void
 */
__STATIC_INLINE void DL_GSC_setVTOR_NS(GSC_Regs* gsc, uint32_t addr_ns)
{
    (gsc->VTOR_NS = addr_ns);
}

/**
 *  @brief set VTOR for S Application Image
 *
 *
 *  @param[in] gsc      Pointer to the register overlay for the peripheral
 *  @param[in] addr_s   Secure addr where S applications Vector Table resides
 *
 *  @return    void
 */
__STATIC_INLINE void DL_GSC_setVTOR_S(GSC_Regs* gsc, uint32_t addr_s)
{
    (gsc->VTOR_S = addr_s);
}

/**
 * @brief Allow secure access to non-secure SRAM regions
 *
 * Configures SRAM protection control to allow secure code to access
 * non-secure SRAM regions by disabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSPCSecureAccessToNSRAM(GSC_Regs* gsc)
{
    gsc->SPC_ATTRIBVIOLS_CONFIG &= ~GSC_SPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Block secure access to non-secure SRAM regions
 *
 * Configures SRAM protection control to block secure code from accessing
 * non-secure SRAM regions by enabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockSPCSecureAccessToNSRAM(GSC_Regs* gsc)
{
    gsc->SPC_ATTRIBVIOLS_CONFIG |= GSC_SPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Allow secure access to non-secure flash regions
 *
 * Configures flash protection control to allow secure code to access
 * non-secure flash regions by disabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowFPCSecureAccessToNSFlash(GSC_Regs* gsc)
{
    gsc->FPC_ATTRIBVIOLS_CONFIG &= ~GSC_FPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Block secure access to non-secure flash regions
 *
 * Configures flash protection control to block secure code from accessing
 * non-secure flash regions by enabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockFPCSecureAccessToNSFlash(GSC_Regs* gsc)
{
    gsc->FPC_ATTRIBVIOLS_CONFIG |= GSC_FPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Allow secure access to non-secure peripherals
 *
 * Configures peripheral protection control to allow secure code to access
 * non-secure peripherals by disabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowPPCSecureAccessToNSPeripheral(GSC_Regs* gsc)
{
    gsc->PPC_ATTRIBVIOLS_CONFIG &= ~GSC_PPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Block secure access to non-secure peripherals
 *
 * Configures peripheral protection control to block secure code from accessing
 * non-secure peripherals by enabling bus fault and NMI generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockPPCSecureAccessToNSPeripheral(GSC_Regs* gsc)
{
    gsc->PPC_ATTRIBVIOLS_CONFIG |= GSC_PPC_ATTRIBVIOLS_CONFIG_SECVIOL_MASK;
}

/**
 * @brief Allow privileged access to non-privileged SRAM regions
 *
 * Configures SRAM protection control to allow privileged code to access
 * non-privileged SRAM regions by disabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSPCPrivilegeAccessToNPSRAM(GSC_Regs* gsc)
{
    gsc->SPC_ATTRIBVIOLP_CONFIG &= ~GSC_SPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief Block privileged access to non-privileged SRAM regions
 *
 * Configures SRAM protection control to block privileged code from accessing
 * non-privileged SRAM regions by enabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockSPCPrivilegeAccessToNPSRAM(GSC_Regs* gsc)
{
    gsc->SPC_ATTRIBVIOLP_CONFIG |= GSC_SPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief Allow privileged access to non-privileged flash regions
 *
 * Configures flash protection control to allow privileged code to access
 * non-privileged flash regions by disabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowFPCPrivilegeAccessToNPFlash(GSC_Regs* gsc)
{
    gsc->FPC_ATTRIBVIOLP_CONFIG &= ~GSC_FPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief Block privileged access to non-privileged flash regions
 *
 * Configures flash protection control to block privileged code from accessing
 * non-privileged flash regions by enabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockFPCPrivilegeAccessToNPFlash(GSC_Regs* gsc)
{
    gsc->FPC_ATTRIBVIOLP_CONFIG |= GSC_FPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief Allow privileged access to non-privileged peripherals
 *
 * Configures peripheral protection control to allow privileged code to access
 * non-privileged peripherals by disabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowPPCPrivilegeAccessToNPPeripheral(
    GSC_Regs* gsc)
{
    gsc->PPC_ATTRIBVIOLP_CONFIG &= ~GSC_PPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief Block privileged access to non-privileged peripherals
 *
 * Configures peripheral protection control to block privileged code from accessing
 * non-privileged peripherals by enabling bus fault generation on violations.
 *
 * @param[in] gsc  Pointer to the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_blockPPCPrivilegeAccessToNPPeripheral(
    GSC_Regs* gsc)
{
    gsc->PPC_ATTRIBVIOLP_CONFIG |= GSC_PPC_ATTRIBVIOLP_CONFIG_PRIVVIOL_MASK;
}

/**
 * @brief UniComm Peripheral Secure Access Instance Selectors
 *
 * This enumeration defines the UniComm instances for configuring secure/non-secure access.
 * Each instance corresponds to a specific UniComm peripheral that can be configured
 * for secure or non-secure access.
 *
 * The values are mapped to the corresponding hardware register offsets defined in:
 * - GSC_PPC_SECATTRIB_UNICOMM register
 */
typedef enum {
    DL_GSC_SECURE_ACCESS_UNICOMM_UC1_0 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_UC1_0_OFS, /*!< UniComm UC1_0 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_UC1_1 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_UC1_1_OFS, /*!< UniComm UC1_1 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_UC2 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_UC2_OFS, /*!< UniComm UC2 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_UC15_0 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_UC15_0_OFS, /*!< UniComm UC15_0 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_UC15_1 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_UC15_1_OFS, /*!< UniComm UC15_1 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_UC12 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_UC12_OFS, /*!< UniComm UC12 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_UC13_0 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_0_OFS, /*!< UniComm UC13_0 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_UC13_1 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_1_OFS, /*!< UniComm UC13_1 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_UC13_2 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_2_OFS, /*!< UniComm UC13_2 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_UC13_3 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_3_OFS, /*!< UniComm UC13_3 secure access control */
    DL_GSC_SECURE_ACCESS_UNICOMM_UC14 =
        GSC_PPC_SECATTRIB_UNICOMM_SEC_UC14_OFS /*!< UniComm UC14 secure access control */
} DL_GSC_SECURE_ACCESS_UNICOMM;

/**
 *  @brief Allow UniComm peripheral access from secure context only
 *
 *  This function configures the specified UniComm peripheral instance to be
 *  accessible only from M33 secure execution context.
 *
 *  @param[in] gsc       Pointer to the register overlay for the GSC peripheral
 *  @param[in] instance  UniComm instance to configure context access for
 *
 *  @return    void
 */
__STATIC_INLINE void DL_GSC_allowUniCommSecureAccess(
    GSC_Regs* gsc, DL_GSC_SECURE_ACCESS_UNICOMM instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC1_0:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC1_0_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC1_1:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC1_1_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC2:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC2_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC15_0:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC15_0_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC15_1:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC15_1_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC12:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC12_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC13_0:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_0_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC13_1:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_1_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC13_2:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_2_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC13_3:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_3_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC14:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC14_MASK;
            break;
        default:
            return;  // Invalid instance
    }
    gsc->PPC_SECATTRIB_UNICOMM |= mask;
}

/**
 * @brief Allow WDT peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowWDTSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_WDT |= GSC_PPC_SECATTRIB_WDT_SEC_WWDT_MASK;
}

/**
 * @brief Allow WDT peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowWDTNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_WDT &= ~GSC_PPC_SECATTRIB_WDT_SEC_WWDT_MASK;
}

/**
 * @brief Check if WDT is configured for secure access
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @return bool        Returns true if secure access is enabled, false for non-secure
 */
__STATIC_INLINE bool DL_GSC_isWDTSecureAccess(GSC_Regs* gsc)
{
    return (
        (gsc->PPC_SECATTRIB_WDT & GSC_PPC_SECATTRIB_WDT_SEC_WWDT_MASK) != 0);
}

/**
 *  @brief Allow UniComm peripheral access from non-secure context
 *
 *  This function configures the specified UniComm peripheral instance to be
 *  accessible from non-secure execution context.
 *
 *  @param[in] gsc       Pointer to the register overlay for the GSC peripheral
 *  @param[in] instance  UniComm instance to configure context access for
 *
 *  @return    void
 */
__STATIC_INLINE void DL_GSC_allowUniCommNonSecureAccess(
    GSC_Regs* gsc, DL_GSC_SECURE_ACCESS_UNICOMM instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC1_0:
            mask = (GSC_PPC_SECATTRIB_UNICOMM_SEC_UC1_0_MASK);
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC1_1:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC1_1_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC2:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC2_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC15_0:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC15_0_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC15_1:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC15_1_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC12:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC12_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC13_0:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_0_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC13_1:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_1_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC13_2:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_2_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC13_3:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC13_3_MASK;
            break;
        case DL_GSC_SECURE_ACCESS_UNICOMM_UC14:
            mask = GSC_PPC_SECATTRIB_UNICOMM_SEC_UC14_MASK;
            break;
        default:
            return;  // Invalid instance
    }
    gsc->PPC_SECATTRIB_UNICOMM &= ~mask;
}

/**
 * @brief ADC Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the ADC instances for configuring secure/non-secure context access.
 * Each instance corresponds to a specific ADC peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_ADC_SECURE_ACCESS_ADC0 =
        GSC_PPC_SECATTRIB_ADC_SEC_ADC0_OFS, /*!< ADC0 M33 secure/non-secure context access control */
    DL_GSC_ADC_SECURE_ACCESS_ADC1 =
        GSC_PPC_SECATTRIB_ADC_SEC_ADC1_OFS /*!< ADC1 M33 secure/non-secure context access control */
} DL_GSC_ADC_SECURE_ACCESS;

/**
 * @brief Timer Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the Timer instances for configuring M33 secure/non-secure context access.
 * Each instance corresponds to a specific Timer peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_TIMER_SECURE_ACCESS_TIMA0_0 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_0_OFS, /*!< TIMA0_0 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMA0_1 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_1_OFS, /*!< TIMA0_1 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG4_0 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_0_OFS, /*!< TIMG4_0 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG4_1 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_1_OFS, /*!< TIMG4_1 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG4_2 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_2_OFS, /*!< TIMG4_2 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG4_3 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_3_OFS, /*!< TIMG4_3 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG12_0 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG12_0_OFS, /*!< TIMG12_0 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG8_0 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_0_OFS, /*!< TIMG8_0 M33 secure/non-secure context access control */
    DL_GSC_TIMER_SECURE_ACCESS_TIMG8_1 =
        GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_1_OFS /*!< TIMG8_1 M33 secure/non-secure context access control */
} DL_GSC_TIMER_SECURE_ACCESS;

/**
 * @brief Allow ADC peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance ADC instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowADCSecureAccess(
    GSC_Regs* gsc, DL_GSC_ADC_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_ADC_SECURE_ACCESS_ADC0:
            mask = GSC_PPC_SECATTRIB_ADC_SEC_ADC0_MASK;
            break;
        case DL_GSC_ADC_SECURE_ACCESS_ADC1:
            mask = GSC_PPC_SECATTRIB_ADC_SEC_ADC1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_ADC |= mask;
}

/**
 * @brief Allow ADC peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance ADC instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowADCNonSecureAccess(
    GSC_Regs* gsc, DL_GSC_ADC_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_ADC_SECURE_ACCESS_ADC0:
            mask = GSC_PPC_SECATTRIB_ADC_SEC_ADC0_MASK;
            break;
        case DL_GSC_ADC_SECURE_ACCESS_ADC1:
            mask = GSC_PPC_SECATTRIB_ADC_SEC_ADC1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_ADC &= ~mask;
}

