TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/driverlib/dl_gsc.h
/**
 * @brief Allow Timer peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance Timer instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowTimerSecureAccess(
    GSC_Regs* gsc, DL_GSC_TIMER_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_TIMER_SECURE_ACCESS_TIMA0_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMA0_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_1_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_1_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_2:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_2_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_3:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_3_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG12_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG12_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG8_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG8_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_TIMER |= mask;
}

/**
 * @brief Allow Timer peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance Timer instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowTimerNonSecureAccess(
    GSC_Regs* gsc, DL_GSC_TIMER_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_TIMER_SECURE_ACCESS_TIMA0_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMA0_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMA0_1_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_1_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_2:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_2_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG4_3:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG4_3_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG12_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG12_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG8_0:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_0_MASK;
            break;
        case DL_GSC_TIMER_SECURE_ACCESS_TIMG8_1:
            mask = GSC_PPC_SECATTRIB_TIMER_SEC_TIMG8_1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_TIMER &= ~mask;
}

/**
 * @brief GPIO Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the GPIO instances for configuring secure/non-secure context access.
 * Each instance corresponds to a specific GPIO peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_GPIO_SECURE_ACCESS_GPIOA =
        GSC_PPC_SECATTRIB_GPIO_SEC_GPIOA_OFS, /*!< GPIOA secure/non-secure context access control */
    DL_GSC_GPIO_SECURE_ACCESS_GPIOB =
        GSC_PPC_SECATTRIB_GPIO_SEC_GPIOB_OFS, /*!< GPIOB secure/non-secure context access control */
    DL_GSC_GPIO_SECURE_ACCESS_GPIOC =
        GSC_PPC_SECATTRIB_GPIO_SEC_GPIOC_OFS /*!< GPIOC secure/non-secure context access control */
} DL_GSC_GPIO_SECURE_ACCESS;

/**
 * @brief MCAN Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the MCAN instances for configuring secure/non-secure context access.
 * Each instance corresponds to a specific MCAN peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_MCAN_SECURE_ACCESS_MCAN0 =
        GSC_PPC_SECATTRIB_MCAN_SEC_MCAN0_OFS, /*!< MCAN0 secure/non-secure context access control */
    DL_GSC_MCAN_SECURE_ACCESS_MCAN1 =
        GSC_PPC_SECATTRIB_MCAN_SEC_MCAN1_OFS /*!< MCAN1 secure/non-secure context access control */
} DL_GSC_MCAN_SECURE_ACCESS;

/**
 * @brief I2S Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the I2S instances for configuring secure/non-secure context access.
 * Each instance corresponds to a specific I2S peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_I2S_SECURE_ACCESS_I2S0 =
        GSC_PPC_SECATTRIB_I2S_SEC_I2S0_OFS, /*!< I2S0 secure/non-secure context access control */
    DL_GSC_I2S_SECURE_ACCESS_I2S1 =
        GSC_PPC_SECATTRIB_I2S_SEC_I2S1_OFS /*!< I2S1 secure/non-secure context access control */
} DL_GSC_I2S_SECURE_ACCESS;

/**
 * @brief ACOMP Peripheral Secure Context Access Selectors
 *
 * This enumeration defines the ACOMP instances for configuring secure/non-secure context access.
 * Each instance corresponds to a specific Analog Comparator peripheral that can be accessed from
 * either secure or non-secure execution context.
 */
typedef enum {
    DL_GSC_ACOMP_SECURE_ACCESS_ACOMP0 =
        GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP0_OFS, /*!< ACOMP0 secure/non-secure context access control */
    DL_GSC_ACOMP_SECURE_ACCESS_ACOMP1 =
        GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP1_OFS /*!< ACOMP1 secure/non-secure context access control */
} DL_GSC_ACOMP_SECURE_ACCESS;

/**
 * @brief Allow GPIO peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance GPIO instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowGPIOSecureAccess(
    GSC_Regs* gsc, DL_GSC_GPIO_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOA:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOA_MASK;
            break;
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOB:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOB_MASK;
            break;
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOC:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOC_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_GPIO |= mask;
}

/**
 * @brief Allow GPIO peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance GPIO instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowGPIONonSecureAccess(
    GSC_Regs* gsc, DL_GSC_GPIO_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOA:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOA_MASK;
            break;
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOB:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOB_MASK;
            break;
        case DL_GSC_GPIO_SECURE_ACCESS_GPIOC:
            mask = GSC_PPC_SECATTRIB_GPIO_SEC_GPIOC_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_GPIO &= ~mask;
}

/**
 * @brief Allow MCAN peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance MCAN instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowMCANSecureAccess(
    GSC_Regs* gsc, DL_GSC_MCAN_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_MCAN_SECURE_ACCESS_MCAN0:
            mask = GSC_PPC_SECATTRIB_MCAN_SEC_MCAN0_MASK;
            break;
        case DL_GSC_MCAN_SECURE_ACCESS_MCAN1:
            mask = GSC_PPC_SECATTRIB_MCAN_SEC_MCAN1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_MCAN |= mask;
}

/**
 * @brief Allow MCAN peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance MCAN instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowMCANNonSecureAccess(
    GSC_Regs* gsc, DL_GSC_MCAN_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_MCAN_SECURE_ACCESS_MCAN0:
            mask = GSC_PPC_SECATTRIB_MCAN_SEC_MCAN0_MASK;
            break;
        case DL_GSC_MCAN_SECURE_ACCESS_MCAN1:
            mask = GSC_PPC_SECATTRIB_MCAN_SEC_MCAN1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_MCAN &= ~mask;
}

/**
 * @brief Allow I2S peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance I2S instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowI2SSecureAccess(
    GSC_Regs* gsc, DL_GSC_I2S_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_I2S_SECURE_ACCESS_I2S0:
            mask = GSC_PPC_SECATTRIB_I2S_SEC_I2S0_MASK;
            break;
        case DL_GSC_I2S_SECURE_ACCESS_I2S1:
            mask = GSC_PPC_SECATTRIB_I2S_SEC_I2S1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_I2S |= mask;
}

/**
 * @brief Allow I2S peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance I2S instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowI2SNonSecureAccess(
    GSC_Regs* gsc, DL_GSC_I2S_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_I2S_SECURE_ACCESS_I2S0:
            mask = GSC_PPC_SECATTRIB_I2S_SEC_I2S0_MASK;
            break;
        case DL_GSC_I2S_SECURE_ACCESS_I2S1:
            mask = GSC_PPC_SECATTRIB_I2S_SEC_I2S1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_I2S &= ~mask;
}

/**
 * @brief Allow ACOMP peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance ACOMP instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowACOMPSecureAccess(
    GSC_Regs* gsc, DL_GSC_ACOMP_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_ACOMP_SECURE_ACCESS_ACOMP0:
            mask = GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP0_MASK;
            break;
        case DL_GSC_ACOMP_SECURE_ACCESS_ACOMP1:
            mask = GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_ACOMP |= mask;
}

/**
 * @brief Allow ACOMP peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 * @param[in] instance ACOMP instance to configure context access for
 */
__STATIC_INLINE void DL_GSC_allowACOMPNonSecureAccess(
    GSC_Regs* gsc, DL_GSC_ACOMP_SECURE_ACCESS instance)
{
    uint32_t mask;
    switch (instance) {
        case DL_GSC_ACOMP_SECURE_ACCESS_ACOMP0:
            mask = GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP0_MASK;
            break;
        case DL_GSC_ACOMP_SECURE_ACCESS_ACOMP1:
            mask = GSC_PPC_SECATTRIB_ACOMP_SEC_ACOMP1_MASK;
            break;
        default:
            return;
    }
    gsc->PPC_SECATTRIB_ACOMP &= ~mask;
}

/**
 * @brief Allow LFSS peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowLFSSSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_LFSS |= GSC_PPC_SECATTRIB_LFSS_SEC_LFSS_MASK;
}

/**
 * @brief Allow LFSS peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowLFSSNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_LFSS &= ~GSC_PPC_SECATTRIB_LFSS_SEC_LFSS_MASK;
}

/**
 * @brief Allow CRC peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowCRCSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_CRC |= GSC_PPC_SECATTRIB_CRC_SEC_CRC_MASK;
}

/**
 * @brief Allow CRC peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowCRCNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_CRC &= ~GSC_PPC_SECATTRIB_CRC_SEC_CRC_MASK;
}

/**
 * @brief Allow AES peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowAESSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_AES |= GSC_PPC_SECATTRIB_AES_SEC_AES_MASK;
}

/**
 * @brief Allow AES peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowAESNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_AES &= ~GSC_PPC_SECATTRIB_AES_SEC_AES_MASK;
}

/**
 * @brief Allow SHA peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSHASecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_SHA |= GSC_PPC_SECATTRIB_SHA_SEC_SHA_MASK;
}

/**
 * @brief Allow SHA peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSHANonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_SHA &= ~GSC_PPC_SECATTRIB_SHA_SEC_SHA_MASK;
}

/**
 * @brief Allow QSPI peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowQSPISecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_QSPI |= GSC_PPC_SECATTRIB_QSPI_SEC_QSPI_MASK;
}

/**
 * @brief Allow QSPI peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowQSPINonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_QSPI &= ~GSC_PPC_SECATTRIB_QSPI_SEC_QSPI_MASK;
}

/**
 * @brief Allow TRNG peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowTRNGSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_TRNG |= GSC_PPC_SECATTRIB_TRNG_SEC_TRNG_MASK;
}

/**
 * @brief Allow TRNG peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowTRNGNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_TRNG &= ~GSC_PPC_SECATTRIB_TRNG_SEC_TRNG_MASK;
}

/**
 * @brief Allow PKA peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowPKASecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_PKA |= GSC_PPC_SECATTRIB_PKA_SEC_PKA_MASK;
}

/**
 * @brief Allow PKA peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowPKANonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_PKA &= ~GSC_PPC_SECATTRIB_PKA_SEC_PKA_MASK;
}

/**
 * @brief Allow IOMUX peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowIOMUXSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_IOMUX |= GSC_PPC_SECATTRIB_IOMUX_SEC_IOMUX_MASK;
}

/**
 * @brief Allow IOMUX peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowIOMUXNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_IOMUX &= ~GSC_PPC_SECATTRIB_IOMUX_SEC_IOMUX_MASK;
}

/**
 * @brief Allow DEBUGSS peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDEBUGSSSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_DEBUGSS |= GSC_PPC_SECATTRIB_DEBUGSS_SEC_DEBUGSS_MASK;
}

/**
 * @brief Allow DEBUGSS peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDEBUGSSNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_DEBUGSS &= ~GSC_PPC_SECATTRIB_DEBUGSS_SEC_DEBUGSS_MASK;
}

/**
 * @brief Allow VREF peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowVREFSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_VREF |= GSC_PPC_SECATTRIB_VREF_SEC_VREF_MASK;
}

/**
 * @brief Allow VREF peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowVREFNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_VREF &= ~GSC_PPC_SECATTRIB_VREF_SEC_VREF_MASK;
}

/**
 * @brief Allow KEYSTORECTL peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowKEYSTORECTLSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_KEYSTORECTL |=
        GSC_PPC_SECATTRIB_KEYSTORECTL_SEC_KEYSTORECTL_MASK;
}

/**
 * @brief Allow KEYSTORECTL peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowKEYSTORECTLNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_KEYSTORECTL &=
        ~GSC_PPC_SECATTRIB_KEYSTORECTL_SEC_KEYSTORECTL_MASK;
}

/**
 * @brief Allow EAM peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowEAMSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_EAM |= GSC_PPC_SECATTRIB_EAM_SEC_EAM_MASK;
}

/**
 * @brief Allow EAM peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowEAMNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_EAM &= ~GSC_PPC_SECATTRIB_EAM_SEC_EAM_MASK;
}

/**
 * @brief Allow WUC peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowWUCSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_WUC |= GSC_PPC_SECATTRIB_WUC_SEC_WUC_MASK;
}

/**
 * @brief Allow WUC peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowWUCNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_WUC &= ~GSC_PPC_SECATTRIB_WUC_SEC_WUC_MASK;
}

/**
 * @brief Allow FRIREGS peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowFRIREGSSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_FRIREGS |= GSC_PPC_SECATTRIB_FRIREGS_SEC_FRIREGS_MASK;
}

/**
 * @brief Allow FRIREGS peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowFRIREGSNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_FRIREGS &= ~GSC_PPC_SECATTRIB_FRIREGS_SEC_FRIREGS_MASK;
}

/**
 * @brief Allow MEMCFG peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowMEMCFGSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_MEMCFG |= GSC_PPC_SECATTRIB_MEMCFG_SEC_MEMCFG_MASK;
}

/**
 * @brief Allow MEMCFG peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowMEMCFGNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_MEMCFG &= ~GSC_PPC_SECATTRIB_MEMCFG_SEC_MEMCFG_MASK;
}

/**
 * @brief Allow SYSCTL peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSYSCTLSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_SYSCTL |= GSC_PPC_SECATTRIB_SYSCTL_SEC_SYSCTL_MASK;
}

/**
 * @brief Allow SYSCTL peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSYSCTLNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_SYSCTL &= ~GSC_PPC_SECATTRIB_SYSCTL_SEC_SYSCTL_MASK;
}

/**
 * @brief Allow SYSCTL peripheral privileged access
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSYSCTLPrivilegeAccess(GSC_Regs* gsc)
{
    gsc->PPC_PRIVATTRIB_SYSCTL |= GSC_PPC_PRIVATTRIB_SYSCTL_PRIV_SYSCTL_MASK;
}

/**
 * @brief Allow SYSCTL peripheral non-privileged access
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowSYSCTLNonPrivilegeAccess(GSC_Regs* gsc)
{
    gsc->PPC_PRIVATTRIB_SYSCTL &= ~GSC_PPC_PRIVATTRIB_SYSCTL_PRIV_SYSCTL_MASK;
}

/**
 * @brief Allow GSC peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowGSCSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_GSC |= GSC_PPC_SECATTRIB_GSC_SEC_GSC_MASK;
}

/**
 * @brief Allow GSC peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowGSCNonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_GSC &= ~GSC_PPC_SECATTRIB_GSC_SEC_GSC_MASK;
}

/**
 * @brief Allow GSC peripheral privileged access
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowGSCPrivilegeAccess(GSC_Regs* gsc)
{
    gsc->PPC_PRIVATTRIB_GSC |= GSC_PPC_PRIVATTRIB_GSC_PRIV_GSC_MASK;
}

/**
 * @brief Allow GSC peripheral non-privileged access
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowGSCNonPrivilegeAccess(GSC_Regs* gsc)
{
    gsc->PPC_PRIVATTRIB_GSC &= ~GSC_PPC_PRIVATTRIB_GSC_PRIV_GSC_MASK;
}

