TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/driverlib/dl_gsc.h
__STATIC_INLINE void DL_GSC_allowDMA0PrivilegeAccess(GSC_Regs* gsc)
{
    gsc->PPC_PRIVATTRIB_DMA |= GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA0_MASK;
}

__STATIC_INLINE void DL_GSC_allowDMA0NonPrivilegeAccess(GSC_Regs* gsc)
{
    gsc->PPC_PRIVATTRIB_DMA &= ~GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA0_MASK;
}

__STATIC_INLINE void DL_GSC_allowDMA1PrivilegeAccess(GSC_Regs* gsc)
{
    gsc->PPC_PRIVATTRIB_DMA |= GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA1_MASK;
}

__STATIC_INLINE void DL_GSC_allowDMA1NonPrivilegeAccess(GSC_Regs* gsc)
{
    gsc->PPC_PRIVATTRIB_DMA &= ~GSC_PPC_PRIVATTRIB_DMA_PRIV_DMA1_MASK;
}

/**
 * @brief Allow DMA0 peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDMA0SecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_DMA |= GSC_PPC_SECATTRIB_DMA_SEC_DMA0_MASK;
}

/**
 * @brief Allow DMA0 peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDMA0NonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_DMA &= ~GSC_PPC_SECATTRIB_DMA_SEC_DMA0_MASK;
}

/**
 * @brief Allow DMA1 peripheral access from secure context only
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDMA1SecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_DMA |= GSC_PPC_SECATTRIB_DMA_SEC_DMA1_MASK;
}

/**
 * @brief Allow DMA1 peripheral access from non-secure context
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_allowDMA1NonSecureAccess(GSC_Regs* gsc)
{
    gsc->PPC_SECATTRIB_DMA &= ~GSC_PPC_SECATTRIB_DMA_SEC_DMA1_MASK;
}

/**
 * @brief Enable PKA SRAM zeroization
 *
 * Enables zeroization functionality for PKA SRAM. When enabled,
 * the PKA SRAM content will be zeroed.
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_enablePKASRAMZeroization(GSC_Regs* gsc)
{
    // Bit is active low - clearing enables zeroization
    gsc->PPC_SPARERW_GSC &= ~GSC_PPC_SPARERW_GSC_ZERO_PKASRAM_MASK;
}

/**
 * @brief Disable PKA SRAM zeroization
 *
 * Disables zeroization functionality for PKA SRAM. When disabled,
 * the PKA SRAM content will be preserved.
 *
 * @param[in] gsc      Pointer to the register overlay for the GSC peripheral
 */
__STATIC_INLINE void DL_GSC_disablePKASRAMZeroization(GSC_Regs* gsc)
{
    // Bit is active low - setting disables zeroization
    gsc->PPC_SPARERW_GSC |= GSC_PPC_SPARERW_GSC_ZERO_PKASRAM_MASK;
}

/** @brief DMA Fixed Trigger Sources */
typedef enum {
    DL_GSC_DMA_FIXED_TRIG_AES_PUB1   = 0,  /*!< AESADV.PUBLISHER_1 */
    DL_GSC_DMA_FIXED_TRIG_AES_PUB2   = 1,  /*!< AESADV.PUBLISHER_2 */
    DL_GSC_DMA_FIXED_TRIG_ADC0_TRIG1 = 2,  /*!< ADC0_DMA_TRIG1 */
    DL_GSC_DMA_FIXED_TRIG_ADC0_TRIG2 = 3,  /*!< ADC0_DMA_TRIG2 */
    DL_GSC_DMA_FIXED_TRIG_ADC0_TRIG3 = 4,  /*!< ADC0_DMA_TRIG3 */
    DL_GSC_DMA_FIXED_TRIG_ADC0_TRIG4 = 5,  /*!< ADC0_DMA_TRIG4 */
    DL_GSC_DMA_FIXED_TRIG_ADC1_TRIG1 = 6,  /*!< ADC1_DMA_TRIG1 */
    DL_GSC_DMA_FIXED_TRIG_ADC1_TRIG2 = 7,  /*!< ADC1_DMA_TRIG2 */
    DL_GSC_DMA_FIXED_TRIG_ADC1_TRIG3 = 8,  /*!< ADC1_DMA_TRIG3 */
    DL_GSC_DMA_FIXED_TRIG_ADC1_TRIG4 = 9,  /*!< ADC1_DMA_TRIG4 */
    DL_GSC_DMA_FIXED_TRIG_SHA_PUB1   = 10, /*!< SHA.PUBLISHER_1 */
} DL_GSC_DMA_FixedTrigger;

/** @brief DMA Regular Trigger Sources */
typedef enum {
    DL_GSC_DMA_TRIG_I2S0_PUB1 = 0,  /*!< I2S0.PUBLISHER_1 */
    DL_GSC_DMA_TRIG_I2S0_PUB2 = 1,  /*!< I2S0.PUBLISHER_2 */
    DL_GSC_DMA_TRIG_I2S1_PUB1 = 2,  /*!< I2S1.PUBLISHER_1 */
    DL_GSC_DMA_TRIG_I2S1_PUB2 = 3,  /*!< I2S1.PUBLISHER_2 */
    DL_GSC_DMA_TRIG_QSPI_PUB1 = 4,  /*!< QSPI.PUBLISHER_1 */
    DL_GSC_DMA_TRIG_QSPI_PUB2 = 5,  /*!< QSPI.PUBLISHER_2 */
    DL_GSC_DMA_TRIG_UC1_0_TX  = 6,  /*!< UC1_0_TX (DMA0 only) */
    DL_GSC_DMA_TRIG_UC1_0_RX  = 7,  /*!< UC1_0_RX (DMA0 only) */
    DL_GSC_DMA_TRIG_UC1_1_TX  = 8,  /*!< UC1_1_TX (DMA0 only) */
    DL_GSC_DMA_TRIG_UC1_1_RX  = 9,  /*!< UC1_1_RX (DMA0 only) */
    DL_GSC_DMA_TRIG_UC2_TX    = 10, /*!< UC2_TX */
    DL_GSC_DMA_TRIG_UC2_RX    = 11, /*!< UC2_RX */
    DL_GSC_DMA_TRIG_UC15_0_TX = 12, /*!< UC15_0_TX */
    DL_GSC_DMA_TRIG_UC15_0_RX = 13, /*!< UC15_0_RX */
    DL_GSC_DMA_TRIG_UC15_1_TX = 14, /*!< UC15_1_TX */
    DL_GSC_DMA_TRIG_UC15_1_RX = 15, /*!< UC15_1_RX */
    DL_GSC_DMA_TRIG_UC12_TX   = 16, /*!< UC12_TX */
    DL_GSC_DMA_TRIG_UC12_RX   = 17, /*!< UC12_RX */
    DL_GSC_DMA_TRIG_UC13_0_TX = 18, /*!< UC13_0_TX */
    DL_GSC_DMA_TRIG_UC13_0_RX = 19, /*!< UC13_0_RX */
    DL_GSC_DMA_TRIG_UC13_1_TX = 20, /*!< UC13_1_TX */
    DL_GSC_DMA_TRIG_UC13_1_RX = 21, /*!< UC13_1_RX */
    DL_GSC_DMA_TRIG_UC13_2_TX = 22, /*!< UC13_2_TX */
    DL_GSC_DMA_TRIG_UC13_2_RX = 23, /*!< UC13_2_RX */
    DL_GSC_DMA_TRIG_UC13_3_TX = 24, /*!< UC13_3_TX */
    DL_GSC_DMA_TRIG_UC13_3_RX = 25, /*!< UC13_3_RX */
    DL_GSC_DMA_TRIG_UC14_TX   = 26, /*!< UC14_TX */
    DL_GSC_DMA_TRIG_UC14_RX   = 27, /*!< UC14_RX */
} DL_GSC_DMA_RegularTrigger;

/** @brief DMA Instance selection */
typedef enum {
    DL_GSC_DMA_INSTANCE_0 = 0, /*!< Route trigger to DMA0 */
    DL_GSC_DMA_INSTANCE_1 = 1  /*!< Route trigger to DMA1 */
} DL_GSC_DMA_Instance;

/* Function prototypes */
void DL_GSC_setFixedTriggerDMAInstance(GSC_Regs* gsc,
    DL_GSC_DMA_FixedTrigger trigger, DL_GSC_DMA_Instance instance);
void DL_GSC_setRegularTriggerDMAInstance(GSC_Regs* gsc,
    DL_GSC_DMA_RegularTrigger trigger, DL_GSC_DMA_Instance instance);
DL_GSC_DMA_Instance DL_GSC_getFixedTriggerDMAInstance(
    GSC_Regs* gsc, DL_GSC_DMA_FixedTrigger trigger);
DL_GSC_DMA_Instance DL_GSC_getRegularTriggerDMAInstance(
    GSC_Regs* gsc, DL_GSC_DMA_RegularTrigger trigger);

typedef enum {
    DL_GSC_SPC_BLOCK_C0B0_512B = GSC_SPC_SECATTRIB0_C0B0_512B_MASK,
    DL_GSC_SPC_BLOCK_C0B1_512B = GSC_SPC_SECATTRIB0_C0B1_512B_MASK,
    DL_GSC_SPC_BLOCK_C0B0_1KB  = GSC_SPC_SECATTRIB0_C0B0_1KB_MASK,
    DL_GSC_SPC_BLOCK_C0B0_2KB  = GSC_SPC_SECATTRIB0_C0B0_2KB_MASK,
    DL_GSC_SPC_BLOCK_C0B0_4KB  = GSC_SPC_SECATTRIB0_C0B0_4KB_MASK,
    DL_GSC_SPC_BLOCK_C0B1_4KB  = GSC_SPC_SECATTRIB0_C0B1_4KB_MASK,
    DL_GSC_SPC_BLOCK_C0B2_4KB  = GSC_SPC_SECATTRIB0_C0B2_4KB_MASK,
    DL_GSC_SPC_BLOCK_C1B0_512B = GSC_SPC_SECATTRIB0_C1B0_512B_MASK,
    DL_GSC_SPC_BLOCK_C1B1_512B = GSC_SPC_SECATTRIB0_C1B1_512B_MASK,
    DL_GSC_SPC_BLOCK_C1B0_1KB  = GSC_SPC_SECATTRIB0_C1B0_1KB_MASK,
    DL_GSC_SPC_BLOCK_C1B0_2KB  = GSC_SPC_SECATTRIB0_C1B0_2KB_MASK,
    DL_GSC_SPC_BLOCK_C1B0_4KB  = GSC_SPC_SECATTRIB0_C1B0_4KB_MASK,
    DL_GSC_SPC_BLOCK_C1B1_4KB  = GSC_SPC_SECATTRIB0_C1B1_4KB_MASK,
    DL_GSC_SPC_BLOCK_C1B2_4KB  = GSC_SPC_SECATTRIB0_C1B2_4KB_MASK,
    DL_GSC_SPC_BLOCK_C2B0_512B = GSC_SPC_SECATTRIB0_C2B0_512B_MASK,
    DL_GSC_SPC_BLOCK_C2B1_512B = GSC_SPC_SECATTRIB0_C2B1_512B_MASK,
    DL_GSC_SPC_BLOCK_C2B0_1KB  = GSC_SPC_SECATTRIB0_C2B0_1KB_MASK,
    DL_GSC_SPC_BLOCK_C2B0_2KB  = GSC_SPC_SECATTRIB0_C2B0_2KB_MASK,
    DL_GSC_SPC_BLOCK_C2B0_4KB  = GSC_SPC_SECATTRIB0_C2B0_4KB_MASK,
    DL_GSC_SPC_BLOCK_C2B1_4KB  = GSC_SPC_SECATTRIB0_C2B1_4KB_MASK,
    DL_GSC_SPC_BLOCK_C2B2_4KB  = GSC_SPC_SECATTRIB0_C2B2_4KB_MASK,
    DL_GSC_SPC_BLOCK_C3B0_512B = GSC_SPC_SECATTRIB0_C3B0_512B_MASK,
    DL_GSC_SPC_BLOCK_C3B1_512B = GSC_SPC_SECATTRIB0_C3B1_512B_MASK,
    DL_GSC_SPC_BLOCK_C3B0_1KB  = GSC_SPC_SECATTRIB0_C3B0_1KB_MASK,
    DL_GSC_SPC_BLOCK_C3B0_2KB  = GSC_SPC_SECATTRIB0_C3B0_2KB_MASK,
    DL_GSC_SPC_BLOCK_C3B0_4KB  = GSC_SPC_SECATTRIB0_C3B0_4KB_MASK,
    DL_GSC_SPC_BLOCK_C3B1_4KB  = GSC_SPC_SECATTRIB0_C3B1_4KB_MASK,
    DL_GSC_SPC_BLOCK_C3B2_4KB  = GSC_SPC_SECATTRIB0_C3B2_4KB_MASK,
} DL_GSC_SPC_BLOCK;

/**
 *  @brief Set DICE Check SUM
 *
 *
 *  @param[in] gsc          Pointer to the register overlay for the peripheral
 *  @param[in] dice         DICE array of 8 32-bit integers
 *  @return    void
 */
__STATIC_INLINE
void DL_GSC_setDICECheckSum(GSC_Regs* gsc, const uint32_t* dice)
{
    uint32_t volatile* diceBaseAddr = (&(gsc->DICE_CHECKSUM0));
    const uint8_t diceLength        = 8U;
    for (uint8_t i = 0; i < diceLength; i++) {
        diceBaseAddr[i] = dice[i];
    }
}

/**
 * @brief Get the major revision number of GSC module
 *
 * @param gsc Pointer to GSC registers
 * @return uint8_t Major revision number
 */
static inline uint8_t DL_GSC_getMajorRevision(GSC_Regs* gsc)
{
    return ((gsc->GSC_REVISION & GSC_GSC_REVISION_MAJREV_MASK) >>
            GSC_GSC_REVISION_MAJREV_OFS);
}

/**
 * @brief Get the minor revision number of GSC module
 *
 * @param gsc Pointer to GSC registers
 * @return uint8_t Minor revision number
 */
static inline uint8_t DL_GSC_getMinorRevision(GSC_Regs* gsc)
{
    return ((gsc->GSC_REVISION & GSC_GSC_REVISION_MINREV_MASK) >>
            GSC_GSC_REVISION_MINREV_OFS);
}

/**
 * @brief Acquires flash semaphore and returns
 * @note  If the following conditions are met, a write of '1' to this bit causes the FLSEMSTAT register to its reset state: <br/>
 * @note  1) The FLSEMSTAT.SEC of the code performing the write is 0x1 and FLSEMSTAT.PRIV of the code performing the write is 0x1 (i.e. secure privilage code can force relinquishing of the semaphore) or
 * @note  2) FLSEMSTAT.ASSIGNED bit is set, and
 * @note      a) FLSEMSTAT.SEC matches security attribute of the code performing the write, and
 * @note      b) FLSEMSTAT.PRIV matches privilege attribute code performing the write.
 *
 *   If the above conditions are not met during the write, the write will be ignored with no error indicated. It is advised that the writing code perform a read of the FLSEMSTAT register to ensure it was cleared after writing to this bit.
 *
 * @note
 * @param  *gsc: GSC_Regs
 * @retval None
 */
__STATIC_INLINE void DL_GSC_acquireFlashSemaphore(GSC_Regs* gsc)
{
    while (!(((gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_ASSIGNED_MASK) ==
                 GSC_FPC_FLSEMSTAT_ASSIGNED_MASK) &&
             ((gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_MATCH_MASK) ==
                 GSC_FPC_FLSEMSTAT_MATCH_MASK))) {
        gsc->FPC_FLSEMREQ = GSC_FPC_FLSEMREQ_REQ_MASK;
    }
}

/**
 * @brief  Returns current Flash Semaphore Status
 *
 * @note Bits	Field Name	Description
 * @note
 * @note   31:31	ASSIGNED	SEC and PRIV fields are valid when this bit is set.
 * @note        0 : SEC and PRIV are unassigned and flash controller is not accessible
 * @note        1 : SEC and PRIV values are valid and the flash controller is currently assigned to them
 * @note
 * @note   30:30	MATCH	On a read, this bit will reflect whether the reader's SEC and PRIV matches the ownership of the flash controller.
 * @note        0 : Code performing read does not own the flash controller semaphore
 * @note        1 : Code performing read owns the flash controller semphore.
 * @note This avoids code from being required to know whether the current code segment owns the flash controller configuration.
 * @note
 * @note   29:17	Reserved_3	Reserved
 * @note
 * @note   16:16	DBGACC	Defines the flash controller semaphore owners debug access indication
 * @note        0x0 : functional access
 * @note        0x1 : Debug access
 * @note
 * @note   15:9	Reserved_2	Reserved
 * @note
 * @note   8:8	PRIV	Defines the flash controller semaphore owners privilage attribute
 * @note        0x0 : non-privilage
 * @note        0x1 :prvilage
 * @note
 * @note   7:1	Reserved_1	Reserved
 * @note
 * @note   0:0	SEC	Defines the flash controller semaphore owners security attribute
 * @note        0x0 : non-secure
 * @note        0x1 :secure
 * @param  *gsc: GSC_Regs
 * @return uint32_t Current flash semaphore status register value
 */
__STATIC_INLINE uint32_t DL_GSC_getFlashSemaphoreStatus(GSC_Regs* gsc)
{
    return gsc->FPC_FLSEMSTAT;
}

/**
 * @brief Request flash semaphore
 *
 * @param gsc         Pointer to the GSC register structure
 */
__STATIC_INLINE void DL_GSC_requestFlashSemaphore(GSC_Regs* gsc)
{
    gsc->FPC_FLSEMREQ = GSC_FPC_FLSEMREQ_REQ_MASK;
}

/**
 * @brief Clear/release flash semaphore
 *
 * @param gsc         Pointer to the GSC register structure
 */
__STATIC_INLINE void DL_GSC_clearFlashSemaphore(GSC_Regs* gsc)
{
    gsc->FPC_FLSEMCLR = GSC_FPC_FLSEMCLR_CLR_MASK;
}

/**
 * @brief Check if current requester owns the flash semaphore
 *
 * @param gsc         Pointer to the GSC register structure
 * @return true       Current requester owns the semaphore
 * @return false      Current requester does not own the semaphore
 *
 * @note The MATCH bit indicates whether the code reading the register owns
 *       the flash semaphore based on matching SEC and PRIV attributes
 */
__STATIC_INLINE bool DL_GSC_hasFlashSemaphoreMatch(GSC_Regs* gsc)
{
    return ((gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_MATCH_MASK) != 0U);
}

/**
 * @brief Check if flash semaphore is assigned
 *
 * @param gsc         Pointer to the GSC register structure
 * @return bool       True if semaphore is assigned, false otherwise
 */
__STATIC_INLINE bool DL_GSC_isFlashSemaphoreAssigned(GSC_Regs* gsc)
{
    return (gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_ASSIGNED_MASK);
}

/**
 * @brief Check if flash semaphore is in secure state
 *
 * @param gsc         Pointer to the GSC register structure
 * @return bool       True if in secure state, false otherwise
 */
__STATIC_INLINE bool DL_GSC_isFlashSemaphoreSecure(GSC_Regs* gsc)
{
    return (gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_SEC_MASK);
}

/**
 * @brief Check if flash semaphore is in privileged state
 *
 * @param gsc         Pointer to the GSC register structure
 * @return bool       True if in privileged state, false otherwise
 */
__STATIC_INLINE bool DL_GSC_isFlashSemaphorePrivileged(GSC_Regs* gsc)
{
    return (gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_PRIV_MASK);
}

/**
 * @brief Debug Access bit functionality in FPC_FLSEMSTAT
 *
 * FPC_FLSEMSTAT Register:
 * - DBGACC (Debug Access):
 *   1 = Semaphore held by debugger
 *   0 = Normal code execution access
 */

