TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/driverlib/dl_gsc.h
__STATIC_INLINE bool DL_GSC_isFlashSemaphoreDebugAccess(GSC_Regs* gsc)
{
    return (gsc->FPC_FLSEMSTAT & GSC_FPC_FLSEMSTAT_DBGACC_MASK);
}

/**
 * @brief Set lock configuration using configuration structure
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] config    Pointer to lock configuration structure
 *
 * @note Once locked, configurations cannot be modified unless uncommitted
 * @note Writing lock requires valid key (0xA551)
 *
 * Example usage:
 * @code
 * DL_GSC_LockConfig lockCfg = {0};  // Initialize all to false
 * lockCfg.vtor = true;              // Lock VTOR configuration
 * lockCfg.dmaTrigSel = true;        // Lock DMA trigger selection
 * DL_GSC_setLockConfiguration(gsc, &lockCfg);
 * @endcode
 */
void DL_GSC_setLockConfiguration(
    GSC_Regs* gsc, const DL_GSC_LockConfig* config);

/**
 * @brief Get current lock configuration
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[out] config   Pointer to structure to store current configuration
 *
 * Example usage:
 * @code
 * DL_GSC_LockConfig currentCfg;
 * DL_GSC_getLockConfiguration(gsc, &currentCfg);
 * if(currentCfg.vtor) {
 *     // VTOR configuration is locked
 * }
 * @endcode
 */
void DL_GSC_getLockConfiguration(GSC_Regs* gsc, DL_GSC_LockConfig* config);

/**
 * @brief Set commit configuration using configuration structure
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[in] config    Pointer to commit configuration structure
 *
 * @note Once committed, configurations cannot be modified until reset
 * @note Writing commit requires valid key (0xA442)
 *
 * Example usage:
 * @code
 * DL_GSC_LockConfig commitCfg = {0};  // Initialize all to false
 * commitCfg.vtor = true;              // Commit VTOR configuration
 * commitCfg.dmaTrigSel = true;        // Commit DMA trigger selection
 * DL_GSC_setCommitConfiguration(gsc, &commitCfg);
 * @endcode
 */
void DL_GSC_setCommitConfiguration(
    GSC_Regs* gsc, const DL_GSC_LockConfig* config);

/**
 * @brief Get current commit configuration
 *
 * @param[in] gsc       Pointer to the GSC peripheral register block
 * @param[out] config   Pointer to structure to store current configuration
 *
 * Example usage:
 * @code
 * DL_GSC_LockConfig currentCommitCfg;
 * DL_GSC_getCommitConfiguration(gsc, &currentCommitCfg);
 * if(currentCommitCfg.vtor) {
 *     // VTOR configuration is committed
 * }
 * @endcode
 */
void DL_GSC_getCommitConfiguration(GSC_Regs* gsc, DL_GSC_LockConfig* config);

/**
 * @brief Configure SRAM security attributes for all memory regions
 *
 * Configures security access permissions for SRAM memory blocks. The memory is divided into
 * 16 pages of 16KB each, with each page further subdivided into configurable chunks.
 * Setting a chunk value to 1 restricts access to secure execution context only.
 * Setting a chunk value to 0 allows non-secure access.
 *
 * @param[in] gsc     Pointer to the GSC peripheral register block
 * @param[in] config  Pointer to SRAM security configuration structure
 *
 * Example usage:
 * @code
 * DL_GSC_SRAMSecurityConfig config = {0}; // Initialize all access as non-secure
 * config.pages[0].chunk_512B_0 = 1;       // Set first 512B chunk as secure
 * config.pages[0].chunk_4KB_0 = 1;        // Set first 4KB chunk as secure
 * DL_GSC_configureSRAMSecurity(gsc, &config);
 * @endcode
 */
void DL_GSC_configureSRAMSecurity(
    GSC_Regs* gsc, const DL_GSC_SRAMSecurityConfig* config);

/**
 * @brief Configure SRAM privilege attributes for all memory regions
 *
 * Configures privilege access permissions for SRAM memory blocks. The memory is divided into
 * 16 pages of 16KB each, with each page further subdivided into configurable chunks.
 * Setting a chunk value to 1 restricts access to privileged execution only.
 * Setting a chunk value to 0 allows non-privileged access.
 *
 * @param[in] gsc     Pointer to the GSC peripheral register block
 * @param[in] config  Pointer to SRAM security configuration structure
 *
 * Example usage:
 * @code
 * DL_GSC_SRAMSecurityConfig config = {0}; // Initialize all access as non-privileged
 * config.pages[0].chunk_512B_0 = 1;       // Set first 512B chunk as privileged
 * config.pages[0].chunk_4KB_0 = 1;        // Set first 4KB chunk as privileged
 * DL_GSC_configureSRAMPrivilege(gsc, &config);
 * @endcode
 */
void DL_GSC_configureSRAMPrivilege(
    GSC_Regs* gsc, const DL_GSC_SRAMSecurityConfig* config);

/**
 * @brief Get current SRAM privilege configuration
 *
 * Reads current privilege access permissions for all SRAM memory blocks.
 * For each chunk in the configuration, returns true if access is restricted
 * to privileged execution context only.
 *
 * @param[in] gsc     Pointer to the GSC peripheral register block
 * @param[out] config Pointer to structure to store current configuration
 *
 * Example usage:
 * @code
 * DL_GSC_SRAMSecurityConfig config;
 * DL_GSC_getSRAMPrivilegeConfig(gsc, &config);
 * if(config.pages[0].chunk_512B_0) {
 *     // First 512B chunk is privileged access only
 * }
 * @endcode
 */
void DL_GSC_getSRAMPrivilegeConfig(
    GSC_Regs* gsc, DL_GSC_SRAMSecurityConfig* config);

/**
 * @brief Get current SRAM security configuration
 *
 * Reads current security access permissions for all SRAM memory blocks.
 * For each chunk in the configuration, returns true if access is restricted
 * to secure execution context only.
 *
 * @param[in] gsc     Pointer to the GSC peripheral register block
 * @param[out] config Pointer to structure to store current configuration
 *
 * Example usage:
 * @code
 * DL_GSC_SRAMSecurityConfig config;
 * DL_GSC_getSRAMSecurityConfig(gsc, &config);
 * if(config.pages[0].chunk_512B_0) {
 *     // First 512B chunk is secure access only
 * }
 * @endcode
 */
void DL_GSC_getSRAMSecurityConfig(
    GSC_Regs* gsc, DL_GSC_SRAMSecurityConfig* config);

#ifdef __cplusplus
}
#endif

#endif /* __MSPM33_HAS_GSC__ */

#endif  // ti_dl_dl_gsc__include

/** @} */
